# Pandas

### Missing data

We will go through the methods on how to handle the missing data in pandas dataframe

In [3]:
# Import pandas and numpy
import pandas as pd
import numpy as np

In [4]:
# Create pandas data frame with NaN values
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [5]:
# Display the df
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Drop the columns or rows with null value
- axis = 0 for row
- axis = 1 for column

In [7]:
# Drop rows with null values
df.dropna() # default axis = 0

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [9]:
# Drop column with null values
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Filling values to the null values

In [12]:
# Fill null values with a constant value
df.fillna(value = 100)

       A      B  C
0    1.0    5.0  1
1    2.0  100.0  2
2  100.0  100.0  3

In [13]:
df.fillna(value = "Null Value")

            A           B  C
0         1.0         5.0  1
1         2.0  Null Value  2
2  Null Value  Null Value  3

In [14]:
# Fill the null values with mean
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [17]:
# Select first column and fill null values with the mean of the column
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method are used to group the rows of data together and call aggregate functions

In [ ]:
# Create a Dictionary to convert into dataframe
data = {'Department': ['Finance', 'Admin', 'HR', 'Development', 'HR', 'Finance'],
        'Person': ['Jack', 'John', 'Amy', 'Jane', 'Sam', 'Harry'],
        'Salary': [20000, 40000, 25000, 50000, 34000, 70000]}

In [ ]:
# Load the dictionary as dataframe

In [ ]:
# Display the dataframe


Now you can use the .groupby() method to group rows together based off of a column name. Here lets group the data based on the department This will create a DataFrameGroupBy object:

In [ ]:
# Use groupby to group the data by Department

In [ ]:
# save the previous groupby object to a varible by_dept

Now we can call the aggregate methods on this groupby object.

In [ ]:
# Get the mean of all columns grouped by department

In [ ]:
# Get the minimum of all columns grouped by department

In [ ]:
# Get the maximum of all columns grouped by department

In [ ]:
# Get the count of all columns grouped by department

In [ ]:
# Get the description of by_dept object

In [ ]:
# Get only the count of salary from the previous description

If we want to see the description of only certain department than we have to use the following command

In [ ]:
# Check the description of HR department only